<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC '-//Apple//DTD PLIST 1.0//EN' 'http://www.apple.com/DTDs/PropertyList-1.0.dtd'>
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Uploads the Wacom Desktop Center package to Jamf.</string>
    <key>Identifier</key>
    <string>com.github.brycemck.jss.WacomDesktopCenter</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Wacom Desktop Center</string>
        <key>CATEGORY</key>
		<string>Drivers</string>
		<key>JSS_INVENTORY_NAME</key>
		<string>Wacom Desktop Center.app</string>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroupTemplate.xml</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>OS_REQUIREMENTS</key>
		<string></string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>The Wacom Desktop Center is required if you are using a Wacom Intuos Pro tablet.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>Wacom Desktop Center.png</string>
		<key>GROUP_NAME</key>
		<string>%NAME%-update</string>
		<key>POLICY_CATEGORY</key>
		<string>Drivers</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.brycemck.pkg.WacomDesktopCenter</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>JSSImporter</string>
            <key>Arguments</key>
			<dict>
				<key>prod_name</key>
                <string>%NAME%</string>
                <key>jss_inventory_name</key>
                <string>%JSS_INVENTORY_NAME%</string>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
			</dict>
		</dict>
    </array>
</dict>
</plist>