<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC '-//Apple//DTD PLIST 1.0//EN' 'http://www.apple.com/DTDs/PropertyList-1.0.dtd'>
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest drivers for the Wacom Intuos Pro tablets, and builds a package.</string>
    <key>Identifier</key>
    <string>com.github.brycemck.pkg.WacomDesktopCenter</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Wacom Desktop Center</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.brycemck.download.WacomDesktopCenter</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/Install Wacom Tablet.pkg</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>